Revit 2026 API

# ColumnInsideWallFailures Properties

---

The BuiltInFailuresColumnInsideWallFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ColumnInsideWall | One element is completely inside another. |
|  | CopingWarningExtension | Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters. |
|  | CopingWarningIgnored | Cuts on concrete members are ignored. |
|  | CopingWarningMedium | Coping applied, but only in Medium Detail Level. |
|  | CopingWarningOffset | Coping applied, but no cut was made. Adjust Coping Distance or Offset parameters. |
|  | StartCutShadowJoin | Two joined walls are in a position to allow automatic insert copying. |
|  | StopCutShadowJoin | Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping. |

#### Reference

BuiltInFailuresColumnInsideWallFailures Class

Autodesk.Revit.DB Namespace